{"meta":{"title":"阿宝","subtitle":"有所选择，有所坚持！","description":"虽说“落地的凤凰不如鸡”；但凤凰总归是凤凰，涅槃重生，历经苦痛，不为人知；但展翅，依旧能够翱翔于天地之间。","author":"阿宝","url":"http://yoursite.com"},"pages":[{"title":"'about'","date":"2018-09-21T08:17:02.000Z","updated":"2018-09-21T08:17:02.019Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":""}],"posts":[{"title":"","slug":"图片上传测试","date":"2018-09-25T11:30:50.176Z","updated":"2018-09-25T11:30:50.177Z","comments":true,"path":"2018/09/25/图片上传测试/","link":"","permalink":"http://yoursite.com/2018/09/25/图片上传测试/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"第1章 初识Java","slug":"第1章 初识Java","date":"2018-09-25T07:11:16.000Z","updated":"2018-09-25T08:23:36.523Z","comments":true,"path":"2018/09/25/第1章 初识Java/","link":"","permalink":"http://yoursite.com/2018/09/25/第1章 初识Java/","excerpt":"","text":"“万丈高楼平地起，盘龙卧虎高山地”，可能用这句话来形容初学Java时的状态是比较恰当的。 1 计算机语言1.1 什么是计算机语言？计算机语言是人们与计算机交流工具 1.2 分类1$ System.out.println(\"Hello World\") 第2章 流程控制2.1 while循环1$ System.out.println(\"Hello World\") 2.2 for循环1$ System.out.println(\"Hello World\") 第3章 面向对象3.1 封装1$ System.out.println(\"Hello World\") 3.2 继承1$ System.out.println(\"Hello World\") More info: Writing 3.3 多态1$ System.out.println(\"Hello World\") More info: Writing","categories":[{"name":"Java","slug":"Java","permalink":"http://yoursite.com/categories/Java/"}],"tags":[{"name":"面向对象","slug":"面向对象","permalink":"http://yoursite.com/tags/面向对象/"}]},{"title":"为什么会写博客","slug":"为什么会写Blog","date":"2018-09-24T16:00:00.000Z","updated":"2018-09-25T07:00:15.111Z","comments":true,"path":"2018/09/25/为什么会写Blog/","link":"","permalink":"http://yoursite.com/2018/09/25/为什么会写Blog/","excerpt":"","text":"讲真，我很讨厌自己明明不甘平凡却又不好好努力的样子。 生活中的我们在智力上是并没有什么差别的，许多人之所以能够取得人生的最终成功，更多地并不是因为他们天赋特别好，而在于他们能够对自己的行为与目标做到坚持不懈。这是难能可贵的。能否坚持下去，一方面是对一个人处事能力的检验，另一方面更是对一个人意志的考验。 1 一个选择在这里，没有旅游美食的炫耀，没有点赞广告的烦扰，有的只是记录生活的宁静，像一个日记本，没有多少人看见，但是你却能看到自己的模样，生活中的一点一滴！ 从我正式理解程序员这个身份是干什么开始，我就想到，我要以这个身份做出一番事业，并且把它当作我的主业来对待。 随着学习的编程语言越来越多，我开始忘记了以前犯过的错误最后是怎么解决的，从最开的用记事本，到office，再到Xmind记录，但也不太方便，然后还印象笔记，用的不习惯，最后我还是想到开博客来记录，因为以前有习惯写qq空间的习惯。 看了很多关于程序员的文章，都说优秀的程序员都会以理解的方式，解决问题，而不是只关注运行结果，现在对自己所学的，只能说有印象，却形成不了一个体系。因此，我选择用博客的方式来不断的整理自己所学，查缺补漏，融会贯通。 2 博客的内容写博客其实并不难，我们可以把它当作一种习惯，是生活的记录，也可以是每日的总结，但是这样的记录要有一些自己的思考反省。博客不是微博，写出来的东西应该是思考的结果。我认为，如果你要开一个博客，博客的内容应该是这样的： • 1.追求质量，宁缺勿滥； • 2.有目的地写，要务实，追求质量 • 3.我手写我心，做最真实的自己 • 4.记录自己学习、思考、总结的过程 • 5.不制造电子垃圾，不拾人牙慧，坚持原创 • 6.分享你的故事、所得、感想、经验。 3 写博客的原因3.1 学会孤独把这一点放在第一的位置，是想说，写博客实在是一件孤独的事情，但是孤独又的确是一件弥足珍贵的东西。 真正的成长都发生在独处时的思考与自我对话中。 一个人默默地写文章，必然会有一些孤独而内心难熬的时刻，这种时候细细品味自己心中那股复杂的焦躁不安，直到它们自然平息。不去逃避孤独，而是面对它，欣赏它。 当你逐渐习惯了直面孤独的煎熬，你就会发现自己对于负面的心情，抑郁的征兆变得更柔韧了一些。可以逐渐不去理会胸口难受的感觉，也可以更快地恢复正常。 孤独是可以沉淀一个人的心智的。 当你享受孤独时，你将在灵魂中穿行。 3.2 修正和完善自己的认知当我们在使用微博、公众号等快餐化产品的时候，我们往往失去了思考、沉淀的过程。我们说的话、发的评论常常是不经过大脑的，很多都是我们经验或者感性的惯性思维。 写博客促使我们重拾 “分析” 和“思考”，帮助我们实现自我认识的修正和完善。前期阅读资料 -&gt;写博中不断对自己提问、梳理思路 -&gt;整理优化博文，经过这个过程，我们可以修正原先错误的认知，抑或加深了对原有知识的理解。 3.3 增强自信心微博、QQ、微信说到底还是一个熟人群，无论你发表的意见如何，大家都不好抛下情面来评论。 但是独立博客是网络上的一个个孤岛，相遇的也大多是陌生人，大家会对你提出质疑甚至是批评，对每一个博主而言，直面他人的质疑和批评需要很大的勇气。 当我们和这些反面意见辩论的多了，我们会发现我们并不怕别人多么不同意自己了，我们在陈述自己观点的时候越来越自信了。 3.4 找到志同道合的人通过博客圈子找到了很多喜欢写作的朋友，有小白、有大牛，有共同兴趣的朋友一起写东西、分享心得难道不是一件快乐的事吗？在交流中感受进步 3.5 使你脱颖而出写博客可以认识不少的朋友，如果以后投身其他产业，你将比别人多出很多优势，真心的朋友远比一顿饭的朋友有用。 你可以通过博客看到自己的变化，别人同样可以。 3.6 提供持续学习的动力写文章是一个持续输出的过程，俗语说 “给出一杯水，需要自己有一桶水”。 写博客很容易出现的一个状况就是没话写，自己知道的都写完了。为了避免这种情况的发生，我们只能不停地学习。 3.7 提高写作能力因为我们的教育对写作重视不够，所以我们的写作能力其实是很差的。我们常常心中想得出来，但是写出来时又感觉怎么都不对，总是无法清楚的表达自己的想法。 这种症状的问题就是写的太少，慢慢去写，我们的写作能力就会提高。之前我写的文字经常很混乱，但是我写这篇文章的时候，语句已经清晰了不少。 3.8 培养恒心、毅力在互联网时代，整天被电子产品包围，刷刷新闻、头条，又或者是抖音、游戏等，我们真真正正沉下心来做一件事的时间有多少，长期以往，相信会导致很多人懒惰、拖延症都并不是不可能。与其把时间浪费在刷淘宝、看八卦上面，不如用书写博客的方式让我们生活变得自律，思维变得活跃。 每个牛逼的人，都有一段苦逼的坚持；去坚持写博客，持续的做一件事，会让生活规律有所寄托。 4 总结人生就像一杯没有加糖的咖啡，喝起来是苦涩的，回味起来却有久久不会退去的余香！其实博客最大的价值还是在于：记录，只希望十年后，二十年后，等你回头看你的博客时，能够让你看到时光在你身上翻飞的样子，即使我的事业不算成功，但能够大声说出来：我这些年，没有白过！ 我希望未来的我，工作多年后的我，依旧能对这份职业抱有热情，不拘于泥，希望梦想还是自己所做到事情。 如果你真的愿意为自己的梦想去努力，最差的结果，不过是大器晚成。","categories":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/categories/随笔/"}],"tags":[]}]}